SpenceKonde/ATTinyCore/avr/boards.txt
#*******************************************************************************
#   ###  #####                          #  #
#  #   #   #    #  #                    #  #
#  #####   #   ###    ###  #  #     # # ####
#  #   #   #    #  #  #  # #  #      #     #
#  #   #   #    #  #  #  #  ###     # #    #
#_____________________________#_________________________________________________
                           ###

attinyx4.build.board=AVR_ATTINYX4
attinyx4.build.core=tiny
attinyx4.build.variant=tinyx4_cw
attinyx4.build.export_merged_output=false
attinyx4.bootloader.extended_fuses=0xFE
attinyx4.bootloader.high_fuses=0b{bootloader.rstbit}101{bootloader.eesave_bit}{bootloader.bod_bits}
attinyx4.bootloader.rstbit=1
attinyx4.build.usbpinset=
attinyx4.build.tuneorcal=
attinyx4.build.softserabr=
attinyx4.build.softser=
attinyx4.build.wiremodeabr=
attinyx4.build.wiremode=
attinyx4.upload.tool=avrdude
attinyx4.bootloader.tool=avrdude
attinyx4.build.bootloader=
attinyx4.build.bootloaderabr=
attinyx4.bootloader.flashstring=

#########################
# Microcontroller menu  #
#########################
attinyx4.menu.chip.84=ATtiny84
attinyx4.menu.chip.84.build.mcu=attiny84
attinyx4.menu.chip.84.upload.maximum_size=8192
attinyx4.menu.chip.84.upload.maximum_data_size=512
attinyx4.menu.chip.44=ATtiny44
attinyx4.menu.chip.44.build.mcu=attiny44
attinyx4.menu.chip.44.upload.maximum_size=4096
attinyx4.menu.chip.44.upload.maximum_data_size=256
attinyx4.menu.chip.24=ATtiny24
attinyx4.menu.chip.24.build.mcu=attiny24
attinyx4.menu.chip.24.upload.maximum_size=2048
attinyx4.menu.chip.24.upload.maximum_data_size=128

#########################
# Clocking menu options #
#########################
attinyx4.menu.clock.internal_8m=8 MHz (internal)
attinyx4.menu.clock.internal_8m.bootloader.low_fuses=0xE2
attinyx4.menu.clock.internal_8m.build.f_cpu=8000000L
attinyx4.menu.clock.internal_8m.build.speed=8m
attinyx4.menu.clock.internal_8m.build.clocksource=0
attinyx4.menu.clock.internal_1m=1 MHz (internal)
attinyx4.menu.clock.internal_1m.bootloader.low_fuses=0x62
attinyx4.menu.clock.internal_1m.build.f_cpu=1000000L
attinyx4.menu.clock.internal_1m.build.speed=1m
attinyx4.menu.clock.internal_1m.build.clocksource=0x10
attinyx4.menu.clock.internal_4m=4 MHz (internal)
attinyx4.menu.clock.internal_4m.bootloader.low_fuses=0x62
attinyx4.menu.clock.internal_4m.build.f_cpu=4000000L
attinyx4.menu.clock.internal_4m.build.speed=4m
attinyx4.menu.clock.internal_4m.build.clocksource=0x10
attinyx4.menu.clock.internal.4m.bootloader.f_cpu=1000000L
attinyx4.menu.clock.internal_2m=2 MHz (internal)
attinyx4.menu.clock.internal_2m.bootloader.low_fuses=0x62
attinyx4.menu.clock.internal_2m.build.f_cpu=2000000L
attinyx4.menu.clock.internal_2m.build.speed=2m
attinyx4.menu.clock.internal_2m.build.clocksource=0x10
attinyx4.menu.clock.internal.2m.bootloader.f_cpu=1000000L
attinyx4.menu.clock.crystal_16m=16 MHz (crystal)
attinyx4.menu.clock.crystal_16m.bootloader.low_fuses=0xFF
attinyx4.menu.clock.crystal_16m.build.f_cpu=16000000UL
attinyx4.menu.clock.crystal_16m.build.speed=16
attinyx4.menu.clock.crystal_16m.build.clocksource=1
attinyx4.menu.clock.crystal_8m=8 MHz (crystal)
attinyx4.menu.clock.crystal_8m.bootloader.low_fuses=0xFF
attinyx4.menu.clock.crystal_8m.build.f_cpu=8000000UL
attinyx4.menu.clock.crystal_8m.build.speed=8
attinyx4.menu.clock.crystal_8m.build.clocksource=1
attinyx4.menu.clock.crystal_20m=20 MHz (crystal)
attinyx4.menu.clock.crystal_20m.bootloader.low_fuses=0xFF
attinyx4.menu.clock.crystal_20m.build.f_cpu=20000000UL
attinyx4.menu.clock.crystal_20m.build.speed=20
attinyx4.menu.clock.crystal_20m.build.clocksource=1
attinyx4.menu.clock.crystal_12m=12 MHz (crystal)
attinyx4.menu.clock.crystal_12m.bootloader.low_fuses=0xFF
attinyx4.menu.clock.crystal_12m.build.f_cpu=12000000UL
attinyx4.menu.clock.crystal_12m.build.speed=12
attinyx4.menu.clock.crystal_12m.build.clocksource=1
attinyx4.menu.clock.crystal_6m=6 MHz (crystal)
attinyx4.menu.clock.crystal_6m.bootloader.low_fuses=0xFD
attinyx4.menu.clock.crystal_6m.build.f_cpu=6000000UL
attinyx4.menu.clock.crystal_6m.build.speed=6
attinyx4.menu.clock.crystal_6m.build.clocksource=1
attinyx4.menu.clock.crystal_18432k=18.432 MHz (crystal)
attinyx4.menu.clock.crystal_18432k.bootloader.low_fuses=0xFF
attinyx4.menu.clock.crystal_18432k.build.f_cpu=18432000UL
attinyx4.menu.clock.crystal_18432k.build.speed=18432k
attinyx4.menu.clock.crystal_18432k.build.clocksource=1
attinyx4.menu.clock.crystal_14746k=14.746 MHz (crystal)
attinyx4.menu.clock.crystal_14746k.bootloader.low_fuses=0xFF
attinyx4.menu.clock.crystal_14746k.build.f_cpu=14746000UL
attinyx4.menu.clock.crystal_14746k.build.speed=14746k
attinyx4.menu.clock.crystal_14746k.build.clocksource=1
attinyx4.menu.clock.crystal_11059k=11.059 MHz (crystal)
attinyx4.menu.clock.crystal_11059k.bootloader.low_fuses=0xFF
attinyx4.menu.clock.crystal_11059k.build.f_cpu=11059000UL
attinyx4.menu.clock.crystal_11059k.build.speed=11059k
attinyx4.menu.clock.crystal_11059k.build.clocksource=1
attinyx4.menu.clock.crystal_9216k=9.216 MHz (crystal)
attinyx4.menu.clock.crystal_9216k.bootloader.low_fuses=0xFF
attinyx4.menu.clock.crystal_9216k.build.f_cpu=9216000UL
attinyx4.menu.clock.crystal_9216k.build.speed=9216k
attinyx4.menu.clock.crystal_9216k.build.clocksource=1
attinyx4.menu.clock.crystal_7372k=7.372 MHz (crystal)
attinyx4.menu.clock.crystal_7372k.bootloader.low_fuses=0xFD
attinyx4.menu.clock.crystal_7372k.build.f_cpu=7372000UL
attinyx4.menu.clock.crystal_7372k.build.speed=7372k
attinyx4.menu.clock.crystal_7372k.build.clocksource=1
attinyx4.menu.clock.internal_12m=12 MHz (internal, tuned)
attinyx4.menu.clock.internal_12m.bootloader.low_fuses=0xE2
attinyx4.menu.clock.internal_12m.build.f_cpu=12000000L
attinyx4.menu.clock.internal_12m.build.speed=12m
attinyx4.menu.clock.internal_12m.build.clocksource=0
attinyx4.menu.clock.internal_8m_tuned=8 MHz (internal, tuned)
attinyx4.menu.clock.internal_8m_tuned.bootloader.low_fuses=0xE2
attinyx4.menu.clock.internal_8m_tuned.build.f_cpu=8000000L
attinyx4.menu.clock.internal_8m_tuned.build.speed=8m
attinyx4.menu.clock.internal_8m_tuned.build.clocksource=0
attinyx4.menu.clock.internal_128k=128 kHz (internal WDT)
attinyx4.menu.clock.internal_128k.build.f_cpu=128000L
attinyx4.menu.clock.internal_128k.build.speed=128k
attinyx4.menu.clock.internal_128k.build.clocksource=3
attinyx4.menu.clock.internal_128k.bootloader.low_fuses=0xC4
attinyx4.menu.clock.extclk_16m=16 MHz (external clock)
attinyx4.menu.clock.extclk_16m.bootloader.low_fuses=0xE0
attinyx4.menu.clock.extclk_16m.build.f_cpu=16000000UL
attinyx4.menu.clock.extclk_16m.build.speed=16
attinyx4.menu.clock.extclk_16m.build.clocksource=2
attinyx4.menu.clock.extclk_8m=8 MHz (external clock)
attinyx4.menu.clock.extclk_8m.bootloader.low_fuses=0xE0
attinyx4.menu.clock.extclk_8m.build.f_cpu=8000000UL
attinyx4.menu.clock.extclk_8m.build.speed=8
attinyx4.menu.clock.extclk_8m.build.clocksource=2
attinyx4.menu.clock.extclk_20m=20 MHz (external clock)
attinyx4.menu.clock.extclk_20m.bootloader.low_fuses=0xE0
attinyx4.menu.clock.extclk_20m.build.f_cpu=20000000UL
attinyx4.menu.clock.extclk_20m.build.speed=20
attinyx4.menu.clock.extclk_20m.build.clocksource=2
attinyx4.menu.clock.extclk_12m=12 MHz (external clock)
attinyx4.menu.clock.extclk_12m.bootloader.low_fuses=0xE0
attinyx4.menu.clock.extclk_12m.build.f_cpu=12000000UL
attinyx4.menu.clock.extclk_12m.build.speed=12
attinyx4.menu.clock.extclk_12m.build.clocksource=2
attinyx4.menu.clock.extclk_6m=6 MHz (external clock)
attinyx4.menu.clock.extclk_6m.bootloader.low_fuses=0xE0
attinyx4.menu.clock.extclk_6m.build.f_cpu=6000000UL
attinyx4.menu.clock.extclk_6m.build.speed=6
attinyx4.menu.clock.extclk_6m.build.clocksource=2
attinyx4.menu.clock.extclk_18432k=18.432 MHz (external clock)
attinyx4.menu.clock.extclk_18432k.bootloader.low_fuses=0xE0
attinyx4.menu.clock.extclk_18432k.build.f_cpu=18432000UL
attinyx4.menu.clock.extclk_18432k.build.speed=18432k
attinyx4.menu.clock.extclk_18432k.build.clocksource=2
attinyx4.menu.clock.extclk_14746k=14.746 MHz (external clock)
attinyx4.menu.clock.extclk_14746k.bootloader.low_fuses=0xE0
attinyx4.menu.clock.extclk_14746k.build.f_cpu=14746000UL
attinyx4.menu.clock.extclk_14746k.build.speed=14746k
attinyx4.menu.clock.extclk_14746k.build.clocksource=2
attinyx4.menu.clock.extclk_11059k=11.059 MHz (external clock)
attinyx4.menu.clock.extclk_11059k.bootloader.low_fuses=0xE0
attinyx4.menu.clock.extclk_11059k.build.f_cpu=11059000UL
attinyx4.menu.clock.extclk_11059k.build.speed=11059k
attinyx4.menu.clock.extclk_11059k.build.clocksource=2
attinyx4.menu.clock.extclk_9216k=9.216 MHz (external clock)
attinyx4.menu.clock.extclk_9216k.bootloader.low_fuses=0xE0
attinyx4.menu.clock.extclk_9216k.build.f_cpu=9216000UL
attinyx4.menu.clock.extclk_9216k.build.speed=9216k
attinyx4.menu.clock.extclk_9216k.build.clocksource=2
attinyx4.menu.clock.extclk_7372k=7.372 MHz (external clock)
attinyx4.menu.clock.extclk_7372k.bootloader.low_fuses=0xE0
attinyx4.menu.clock.extclk_7372k.build.f_cpu=7372000UL
attinyx4.menu.clock.extclk_7372k.build.speed=7372k
attinyx4.menu.clock.extclk_7372k.build.clocksource=2

#########################
# Pin Mapping menu      #
#########################
attinyx4.menu.pinmap.default=Standard (clockwise)
attinyx4.menu.pinmap.ccw=Legacy (counterclockwise)
attinyx4.menu.pinmap.ccw.build.variant=tinyx4_legacy
attinyx4.menu.pinmap.default.build.pinmapabr=.cw
attinyx4.menu.pinmap.ccw.build.pinmapabr=.ccw

#########################
# Retain EEPROM menu    #
#########################
attinyx4.menu.eesave.aenable=EEPROM retained
attinyx4.menu.eesave.aenable.bootloader.eesave_bit=0
attinyx4.menu.eesave.disable=EEPROM not retained
attinyx4.menu.eesave.disable.bootloader.eesave_bit=1

#########################
# Software Serial menu  #
#########################
attinyx4.menu.softserial.enable=RX on PA2, TX on PA (default PA1)
attinyx4.menu.softserial.txonly=No receiving, transmit only.
attinyx4.menu.softserial.txonly.build.softser=-DSOFT_TX_ONLY
attinyx4.menu.softserial.txonly.build.softserabr=ssTX

#########################
# BrownOut Detect menu  #
#########################
attinyx4.menu.bod.disable=B.O.D. Disabled (saves power)
attinyx4.menu.bod.disable.bootloader.bod_bits=111
attinyx4.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx4.menu.bod.1v8.bootloader.bod_bits=110
attinyx4.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx4.menu.bod.2v7.bootloader.bod_bits=101
attinyx4.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx4.menu.bod.4v3.bootloader.bod_bits=100

#########################
# millis/micros menu    #
#########################
attinyx4.menu.millis.enabled=Enabled
attinyx4.menu.millis.enabled.build.millis=
attinyx4.menu.millis.enabled.build.millisabr=
attinyx4.menu.millis.disabled=Disabled (saves flash)
attinyx4.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attinyx4.menu.millis.disabled.build.millisabr=mNONE

