SpenceKonde/ATTinyCore/avr/boards.txt
#*******************************************************************************
#   ###  #####                          #####
#  #   #   #    #  #                       #
#  #####   #   ###    ###  #  #     # #   #
#  #   #   #    #  #  #  # #  #      #    #
#  #   #   #    #  #  #  #  ###     # #   #
#_____________________________#_________________________________________________
                           ###

attinyx7.build.board=AVR_ATTINYX7
attinyx7.build.core=tiny
attinyx7.build.variant=tinyx7
attinyx7.build.export_merged_output=false
attinyx7.bootloader.extended_fuses=0xFE
attinyx7.bootloader.high_fuses=0b{bootloader.rstbit}101{bootloader.eesave_bit}{bootloader.bod_bits}
attinyx7.bootloader.rstbit=1
attinyx7.build.usbpinset=
attinyx7.build.tuneorcal=
attinyx7.build.softserabr=
attinyx7.build.softser=
attinyx7.build.wiremodeabr=
attinyx7.build.wiremode=
attinyx7.upload.tool=avrdude
attinyx7.bootloader.tool=avrdude
attinyx7.build.bootloader=
attinyx7.build.bootloaderabr=
attinyx7.bootloader.flashstring=

#########################
# Microcontroller menu  #
#########################
attinyx7.menu.chip.167=ATtiny167
attinyx7.menu.chip.167.build.mcu=attiny167
attinyx7.menu.chip.167.upload.maximum_size=16384
attinyx7.menu.chip.87=ATtiny87
attinyx7.menu.chip.87.build.mcu=attiny87
attinyx7.menu.chip.87.upload.maximum_size=8196

#########################
# Clocking menu options #
#########################
attinyx7.menu.clock.internal_8m=8 MHz (internal)
attinyx7.menu.clock.internal_8m.bootloader.low_fuses=0xE2
attinyx7.menu.clock.internal_8m.build.f_cpu=8000000L
attinyx7.menu.clock.internal_8m.build.speed=8m
attinyx7.menu.clock.internal_8m.build.clocksource=0
attinyx7.menu.clock.internal_1m=1 MHz (internal)
attinyx7.menu.clock.internal_1m.bootloader.low_fuses=0x62
attinyx7.menu.clock.internal_1m.build.f_cpu=1000000L
attinyx7.menu.clock.internal_1m.build.speed=1m
attinyx7.menu.clock.internal_1m.build.clocksource=0x10
attinyx7.menu.clock.internal_4m=4 MHz (internal)
attinyx7.menu.clock.internal_4m.bootloader.low_fuses=0x62
attinyx7.menu.clock.internal_4m.build.f_cpu=4000000L
attinyx7.menu.clock.internal_4m.build.speed=4m
attinyx7.menu.clock.internal_4m.build.clocksource=0x10
attinyx7.menu.clock.internal.4m.bootloader.f_cpu=1000000L
attinyx7.menu.clock.internal_2m=2 MHz (internal)
attinyx7.menu.clock.internal_2m.bootloader.low_fuses=0x62
attinyx7.menu.clock.internal_2m.build.f_cpu=2000000L
attinyx7.menu.clock.internal_2m.build.speed=2m
attinyx7.menu.clock.internal_2m.build.clocksource=0x10
attinyx7.menu.clock.internal.2m.bootloader.f_cpu=1000000L
attinyx7.menu.clock.crystal_16m=16 MHz (crystal)
attinyx7.menu.clock.crystal_16m.bootloader.low_fuses=0xFF
attinyx7.menu.clock.crystal_16m.build.f_cpu=16000000UL
attinyx7.menu.clock.crystal_16m.build.speed=16
attinyx7.menu.clock.crystal_16m.build.clocksource=1
attinyx7.menu.clock.crystal_8m=8 MHz (crystal)
attinyx7.menu.clock.crystal_8m.bootloader.low_fuses=0xFF
attinyx7.menu.clock.crystal_8m.build.f_cpu=8000000UL
attinyx7.menu.clock.crystal_8m.build.speed=8
attinyx7.menu.clock.crystal_8m.build.clocksource=1
attinyx7.menu.clock.crystal_20m=20 MHz (crystal)
attinyx7.menu.clock.crystal_20m.bootloader.low_fuses=0xFF
attinyx7.menu.clock.crystal_20m.build.f_cpu=20000000UL
attinyx7.menu.clock.crystal_20m.build.speed=20
attinyx7.menu.clock.crystal_20m.build.clocksource=1
attinyx7.menu.clock.crystal_12m=12 MHz (crystal)
attinyx7.menu.clock.crystal_12m.bootloader.low_fuses=0xFF
attinyx7.menu.clock.crystal_12m.build.f_cpu=12000000UL
attinyx7.menu.clock.crystal_12m.build.speed=12
attinyx7.menu.clock.crystal_12m.build.clocksource=1
attinyx7.menu.clock.crystal_6m=6 MHz (crystal)
attinyx7.menu.clock.crystal_6m.bootloader.low_fuses=0xFD
attinyx7.menu.clock.crystal_6m.build.f_cpu=6000000UL
attinyx7.menu.clock.crystal_6m.build.speed=6
attinyx7.menu.clock.crystal_6m.build.clocksource=1
attinyx7.menu.clock.crystal_18432k=18.432 MHz (crystal)
attinyx7.menu.clock.crystal_18432k.bootloader.low_fuses=0xFF
attinyx7.menu.clock.crystal_18432k.build.f_cpu=18432000UL
attinyx7.menu.clock.crystal_18432k.build.speed=18432k
attinyx7.menu.clock.crystal_18432k.build.clocksource=1
attinyx7.menu.clock.crystal_14746k=14.746 MHz (crystal)
attinyx7.menu.clock.crystal_14746k.bootloader.low_fuses=0xFF
attinyx7.menu.clock.crystal_14746k.build.f_cpu=14746000UL
attinyx7.menu.clock.crystal_14746k.build.speed=14746k
attinyx7.menu.clock.crystal_14746k.build.clocksource=1
attinyx7.menu.clock.crystal_11059k=11.059 MHz (crystal)
attinyx7.menu.clock.crystal_11059k.bootloader.low_fuses=0xFF
attinyx7.menu.clock.crystal_11059k.build.f_cpu=11059000UL
attinyx7.menu.clock.crystal_11059k.build.speed=11059k
attinyx7.menu.clock.crystal_11059k.build.clocksource=1
attinyx7.menu.clock.crystal_9216k=9.216 MHz (crystal)
attinyx7.menu.clock.crystal_9216k.bootloader.low_fuses=0xFF
attinyx7.menu.clock.crystal_9216k.build.f_cpu=9216000UL
attinyx7.menu.clock.crystal_9216k.build.speed=9216k
attinyx7.menu.clock.crystal_9216k.build.clocksource=1
attinyx7.menu.clock.crystal_7372k=7.372 MHz (crystal)
attinyx7.menu.clock.crystal_7372k.bootloader.low_fuses=0xFD
attinyx7.menu.clock.crystal_7372k.build.f_cpu=7372000UL
attinyx7.menu.clock.crystal_7372k.build.speed=7372k
attinyx7.menu.clock.crystal_7372k.build.clocksource=1
attinyx7.menu.clock.internal_12m=12 MHz (internal, tuned)
attinyx7.menu.clock.internal_12m.bootloader.low_fuses=0xE2
attinyx7.menu.clock.internal_12m.build.f_cpu=12000000L
attinyx7.menu.clock.internal_12m.build.speed=12m
attinyx7.menu.clock.internal_12m.build.clocksource=0
attinyx7.menu.clock.internal_8m_tuned=8 MHz (internal, tuned)
attinyx7.menu.clock.internal_8m_tuned.bootloader.low_fuses=0xE2
attinyx7.menu.clock.internal_8m_tuned.build.f_cpu=8000000L
attinyx7.menu.clock.internal_8m_tuned.build.speed=8m
attinyx7.menu.clock.internal_8m_tuned.build.clocksource=0
attinyx7.menu.clock.internal_128k=128 kHz (internal WDT)
attinyx7.menu.clock.internal_128k.build.f_cpu=128000L
attinyx7.menu.clock.internal_128k.build.speed=128k
attinyx7.menu.clock.internal_128k.build.clocksource=3
attinyx7.menu.clock.internal_128k.bootloader.low_fuses=0xC3
attinyx7.menu.clock.extclk_16m=16 MHz (external clock)
attinyx7.menu.clock.extclk_16m.bootloader.low_fuses=0xE0
attinyx7.menu.clock.extclk_16m.build.f_cpu=16000000UL
attinyx7.menu.clock.extclk_16m.build.speed=16
attinyx7.menu.clock.extclk_16m.build.clocksource=2
attinyx7.menu.clock.extclk_8m=8 MHz (external clock)
attinyx7.menu.clock.extclk_8m.bootloader.low_fuses=0xE0
attinyx7.menu.clock.extclk_8m.build.f_cpu=8000000UL
attinyx7.menu.clock.extclk_8m.build.speed=8
attinyx7.menu.clock.extclk_8m.build.clocksource=2
attinyx7.menu.clock.extclk_20m=20 MHz (external clock)
attinyx7.menu.clock.extclk_20m.bootloader.low_fuses=0xE0
attinyx7.menu.clock.extclk_20m.build.f_cpu=20000000UL
attinyx7.menu.clock.extclk_20m.build.speed=20
attinyx7.menu.clock.extclk_20m.build.clocksource=2
attinyx7.menu.clock.extclk_12m=12 MHz (external clock)
attinyx7.menu.clock.extclk_12m.bootloader.low_fuses=0xE0
attinyx7.menu.clock.extclk_12m.build.f_cpu=12000000UL
attinyx7.menu.clock.extclk_12m.build.speed=12
attinyx7.menu.clock.extclk_12m.build.clocksource=2
attinyx7.menu.clock.extclk_6m=6 MHz (external clock)
attinyx7.menu.clock.extclk_6m.bootloader.low_fuses=0xE0
attinyx7.menu.clock.extclk_6m.build.f_cpu=6000000UL
attinyx7.menu.clock.extclk_6m.build.speed=6
attinyx7.menu.clock.extclk_6m.build.clocksource=2
attinyx7.menu.clock.extclk_18432k=18.432 MHz (external clock)
attinyx7.menu.clock.extclk_18432k.bootloader.low_fuses=0xE0
attinyx7.menu.clock.extclk_18432k.build.f_cpu=18432000UL
attinyx7.menu.clock.extclk_18432k.build.speed=18432k
attinyx7.menu.clock.extclk_18432k.build.clocksource=2
attinyx7.menu.clock.extclk_14746k=14.746 MHz (external clock)
attinyx7.menu.clock.extclk_14746k.bootloader.low_fuses=0xE0
attinyx7.menu.clock.extclk_14746k.build.f_cpu=14746000UL
attinyx7.menu.clock.extclk_14746k.build.speed=14746k
attinyx7.menu.clock.extclk_14746k.build.clocksource=2
attinyx7.menu.clock.extclk_11059k=11.059 MHz (external clock)
attinyx7.menu.clock.extclk_11059k.bootloader.low_fuses=0xE0
attinyx7.menu.clock.extclk_11059k.build.f_cpu=11059000UL
attinyx7.menu.clock.extclk_11059k.build.speed=11059k
attinyx7.menu.clock.extclk_11059k.build.clocksource=2
attinyx7.menu.clock.extclk_9216k=9.216 MHz (external clock)
attinyx7.menu.clock.extclk_9216k.bootloader.low_fuses=0xE0
attinyx7.menu.clock.extclk_9216k.build.f_cpu=9216000UL
attinyx7.menu.clock.extclk_9216k.build.speed=9216k
attinyx7.menu.clock.extclk_9216k.build.clocksource=2
attinyx7.menu.clock.extclk_7372k=7.372 MHz (external clock)
attinyx7.menu.clock.extclk_7372k.bootloader.low_fuses=0xE0
attinyx7.menu.clock.extclk_7372k.build.f_cpu=7372000UL
attinyx7.menu.clock.extclk_7372k.build.speed=7372k
attinyx7.menu.clock.extclk_7372k.build.clocksource=2

#########################
# Pin Mapping menu      #
#########################
attinyx7.menu.pinmap.default=Standard
attinyx7.menu.pinmap.digi=Digispark Pro
attinyx7.menu.pinmap.digi.build.variant=tinyx7_digi
attinyx7.menu.pinmap.legacy=Legacy
attinyx7.menu.pinmap.legacy.build.variant=tinyx7_legacy
attinyx7.menu.pinmap.default.build.pinmapabr=
attinyx7.menu.pinmap.digi.build.pinmapabr=.digi
attinyx7.menu.pinmap.legacy.build.pinmapabr=.old

#########################
# Retain EEPROM menu    #
#########################
attinyx7.menu.eesave.aenable=EEPROM retained
attinyx7.menu.eesave.aenable.bootloader.eesave_bit=0
attinyx7.menu.eesave.disable=EEPROM not retained
attinyx7.menu.eesave.disable.bootloader.eesave_bit=1

#########################
# BrownOut Detect menu  #
#########################
attinyx7.menu.bod.disable=B.O.D. Disabled (saves power)
attinyx7.menu.bod.disable.bootloader.bod_bits=111
attinyx7.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx7.menu.bod.1v8.bootloader.bod_bits=110
attinyx7.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx7.menu.bod.2v7.bootloader.bod_bits=101
attinyx7.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx7.menu.bod.4v3.bootloader.bod_bits=100

#########################
# millis/micros menu    #
#########################
attinyx7.menu.millis.enabled=Enabled
attinyx7.menu.millis.enabled.build.millis=
attinyx7.menu.millis.enabled.build.millisabr=
attinyx7.menu.millis.disabled=Disabled (saves flash)
attinyx7.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attinyx7.menu.millis.disabled.build.millisabr=mNONE

