SpenceKonde/ATTinyCore/avr/boards.txt
#*******************************************************************************
#   ###  #####                       ##    #   ###  #  #
#  #   #   #    #  #                ###   #       # #  #
#  #####   #   ###    ###  #  #      ##  ####   ##  ####
#  #   #   #    #  #  #  # #  #      ##  #   #    #    #
#  #   #   #    #  #  #  #  ###     ####  ###  ###     #
#_____________________________#_________________________________________________
                           ###

attiny1634.build.board=AVR_ATTINY1634
attiny1634.build.core=tiny
attiny1634.build.variant=tiny1634_cw
attiny1634.build.export_merged_output=false
attiny1634.bootloader.extended_fuses=0b111{bootloader.bodpd_bits}{bootloader.bodact_bits}0
attiny1634.bootloader.high_fuses=0b{bootloader.rstbit}101{bootloader.eesave_bit}{bootloader.bod_bits}
attiny1634.bootloader.rstbit=1
attiny1634.build.usbpinset=
attiny1634.build.tuneorcal=
attiny1634.build.softserabr=
attiny1634.build.softser=
attiny1634.build.wiremodeabr=
attiny1634.build.wiremode=
attiny1634.upload.tool=avrdude
attiny1634.bootloader.tool=avrdude
attiny1634.build.bootloader=
attiny1634.build.bootloaderabr=
attiny1634.bootloader.flashstring=
attiny1634.build.mcu=attiny1634

#########################
# Clocking menu options #
#########################
attiny1634.menu.clock.internal_8m_4v5=8 MHz (internal > 4.5V)
attiny1634.menu.clock.internal_8m_4v5.bootloader.low_fuses=0xE2
attiny1634.menu.clock.internal_8m_4v5.build.f_cpu=8000000L
attiny1634.menu.clock.internal_8m_4v5.build.speed=8m
attiny1634.menu.clock.internal_8m_4v5.build.clocksource=0
attiny1634.menu.clock.internal_8m_4v5.build.tuneorcal=-DCAL_NUDGE_DOWN
attiny1634.menu.clock.internal_8m=8 MHz (internal)
attiny1634.menu.clock.internal_8m.bootloader.low_fuses=0xE2
attiny1634.menu.clock.internal_8m.build.f_cpu=8000000L
attiny1634.menu.clock.internal_8m.build.speed=8m
attiny1634.menu.clock.internal_8m.build.clocksource=0
attiny1634.menu.clock.internal_1m=1 MHz (internal)
attiny1634.menu.clock.internal_1m.bootloader.low_fuses=0x62
attiny1634.menu.clock.internal_1m.build.f_cpu=1000000L
attiny1634.menu.clock.internal_1m.build.speed=1m
attiny1634.menu.clock.internal_1m.build.clocksource=0x10
attiny1634.menu.clock.internal_4m=4 MHz (internal)
attiny1634.menu.clock.internal_4m.bootloader.low_fuses=0x62
attiny1634.menu.clock.internal_4m.build.f_cpu=4000000L
attiny1634.menu.clock.internal_4m.build.speed=4m
attiny1634.menu.clock.internal_4m.build.clocksource=0x10
attiny1634.menu.clock.internal.4m.bootloader.f_cpu=1000000L
attiny1634.menu.clock.internal_2m=2 MHz (internal)
attiny1634.menu.clock.internal_2m.bootloader.low_fuses=0x62
attiny1634.menu.clock.internal_2m.build.f_cpu=2000000L
attiny1634.menu.clock.internal_2m.build.speed=2m
attiny1634.menu.clock.internal_2m.build.clocksource=0x10
attiny1634.menu.clock.internal.2m.bootloader.f_cpu=1000000L
attiny1634.menu.clock.crystal_16m=16 MHz (crystal)
attiny1634.menu.clock.crystal_16m.bootloader.low_fuses=0xFF
attiny1634.menu.clock.crystal_16m.build.f_cpu=16000000UL
attiny1634.menu.clock.crystal_16m.build.speed=16
attiny1634.menu.clock.crystal_16m.build.clocksource=1
attiny1634.menu.clock.crystal_8m=8 MHz (crystal)
attiny1634.menu.clock.crystal_8m.bootloader.low_fuses=0xFF
attiny1634.menu.clock.crystal_8m.build.f_cpu=8000000UL
attiny1634.menu.clock.crystal_8m.build.speed=8
attiny1634.menu.clock.crystal_8m.build.clocksource=1
attiny1634.menu.clock.crystal_20m=20 MHz (crystal)
attiny1634.menu.clock.crystal_20m.bootloader.low_fuses=0xFF
attiny1634.menu.clock.crystal_20m.build.f_cpu=20000000UL
attiny1634.menu.clock.crystal_20m.build.speed=20
attiny1634.menu.clock.crystal_20m.build.clocksource=1
attiny1634.menu.clock.crystal_12m=12 MHz (crystal)
attiny1634.menu.clock.crystal_12m.bootloader.low_fuses=0xFF
attiny1634.menu.clock.crystal_12m.build.f_cpu=12000000UL
attiny1634.menu.clock.crystal_12m.build.speed=12
attiny1634.menu.clock.crystal_12m.build.clocksource=1
attiny1634.menu.clock.crystal_6m=6 MHz (crystal)
attiny1634.menu.clock.crystal_6m.bootloader.low_fuses=0xFD
attiny1634.menu.clock.crystal_6m.build.f_cpu=6000000UL
attiny1634.menu.clock.crystal_6m.build.speed=6
attiny1634.menu.clock.crystal_6m.build.clocksource=1
attiny1634.menu.clock.crystal_18432k=18.432 MHz (crystal)
attiny1634.menu.clock.crystal_18432k.bootloader.low_fuses=0xFF
attiny1634.menu.clock.crystal_18432k.build.f_cpu=18432000UL
attiny1634.menu.clock.crystal_18432k.build.speed=18432k
attiny1634.menu.clock.crystal_18432k.build.clocksource=1
attiny1634.menu.clock.crystal_14746k=14.746 MHz (crystal)
attiny1634.menu.clock.crystal_14746k.bootloader.low_fuses=0xFF
attiny1634.menu.clock.crystal_14746k.build.f_cpu=14746000UL
attiny1634.menu.clock.crystal_14746k.build.speed=14746k
attiny1634.menu.clock.crystal_14746k.build.clocksource=1
attiny1634.menu.clock.crystal_11059k=11.059 MHz (crystal)
attiny1634.menu.clock.crystal_11059k.bootloader.low_fuses=0xFF
attiny1634.menu.clock.crystal_11059k.build.f_cpu=11059000UL
attiny1634.menu.clock.crystal_11059k.build.speed=11059k
attiny1634.menu.clock.crystal_11059k.build.clocksource=1
attiny1634.menu.clock.crystal_9216k=9.216 MHz (crystal)
attiny1634.menu.clock.crystal_9216k.bootloader.low_fuses=0xFF
attiny1634.menu.clock.crystal_9216k.build.f_cpu=9216000UL
attiny1634.menu.clock.crystal_9216k.build.speed=9216k
attiny1634.menu.clock.crystal_9216k.build.clocksource=1
attiny1634.menu.clock.crystal_7372k=7.372 MHz (crystal)
attiny1634.menu.clock.crystal_7372k.bootloader.low_fuses=0xFD
attiny1634.menu.clock.crystal_7372k.build.f_cpu=7372000UL
attiny1634.menu.clock.crystal_7372k.build.speed=7372k
attiny1634.menu.clock.crystal_7372k.build.clocksource=1
attiny1634.menu.clock.internal_12m=12 MHz (internal, tuned)
attiny1634.menu.clock.internal_12m.bootloader.low_fuses=0xE2
attiny1634.menu.clock.internal_12m.build.f_cpu=12000000L
attiny1634.menu.clock.internal_12m.build.speed=12m
attiny1634.menu.clock.internal_12m.build.clocksource=0
attiny1634.menu.clock.internal_8m_tuned=8 MHz (internal, tuned)
attiny1634.menu.clock.internal_8m_tuned_low.bootloader.low_fuses=0xE2
attiny1634.menu.clock.internal_8m_tuned_low.build.f_cpu=8000000L
attiny1634.menu.clock.internal_8m_tuned_low.build.speed=8m
attiny1634.menu.clock.internal_8m_tuned_low.build.clocksource=0
attiny1634.menu.clock.internal_8m_tuned_high=8 MHz (internal, tuned)
attiny1634.menu.clock.internal_8m_tuned_high.bootloader.low_fuses=0xE2
attiny1634.menu.clock.internal_8m_tuned_high.build.f_cpu=8000000L
attiny1634.menu.clock.internal_8m_tuned_high.build.speed=8m
attiny1634.menu.clock.internal_8m_tuned_high.build.clocksource=0
attiny1634.menu.clock.extclk_16m=16 MHz (external clock)
attiny1634.menu.clock.extclk_16m.bootloader.low_fuses=0xE0
attiny1634.menu.clock.extclk_16m.build.f_cpu=16000000UL
attiny1634.menu.clock.extclk_16m.build.speed=16
attiny1634.menu.clock.extclk_16m.build.clocksource=2
attiny1634.menu.clock.extclk_8m=8 MHz (external clock)
attiny1634.menu.clock.extclk_8m.bootloader.low_fuses=0xE0
attiny1634.menu.clock.extclk_8m.build.f_cpu=8000000UL
attiny1634.menu.clock.extclk_8m.build.speed=8
attiny1634.menu.clock.extclk_8m.build.clocksource=2
attiny1634.menu.clock.extclk_20m=20 MHz (external clock)
attiny1634.menu.clock.extclk_20m.bootloader.low_fuses=0xE0
attiny1634.menu.clock.extclk_20m.build.f_cpu=20000000UL
attiny1634.menu.clock.extclk_20m.build.speed=20
attiny1634.menu.clock.extclk_20m.build.clocksource=2
attiny1634.menu.clock.extclk_12m=12 MHz (external clock)
attiny1634.menu.clock.extclk_12m.bootloader.low_fuses=0xE0
attiny1634.menu.clock.extclk_12m.build.f_cpu=12000000UL
attiny1634.menu.clock.extclk_12m.build.speed=12
attiny1634.menu.clock.extclk_12m.build.clocksource=2
attiny1634.menu.clock.extclk_6m=6 MHz (external clock)
attiny1634.menu.clock.extclk_6m.bootloader.low_fuses=0xE0
attiny1634.menu.clock.extclk_6m.build.f_cpu=6000000UL
attiny1634.menu.clock.extclk_6m.build.speed=6
attiny1634.menu.clock.extclk_6m.build.clocksource=2
attiny1634.menu.clock.extclk_18432k=18.432 MHz (external clock)
attiny1634.menu.clock.extclk_18432k.bootloader.low_fuses=0xE0
attiny1634.menu.clock.extclk_18432k.build.f_cpu=18432000UL
attiny1634.menu.clock.extclk_18432k.build.speed=18432k
attiny1634.menu.clock.extclk_18432k.build.clocksource=2
attiny1634.menu.clock.extclk_14746k=14.746 MHz (external clock)
attiny1634.menu.clock.extclk_14746k.bootloader.low_fuses=0xE0
attiny1634.menu.clock.extclk_14746k.build.f_cpu=14746000UL
attiny1634.menu.clock.extclk_14746k.build.speed=14746k
attiny1634.menu.clock.extclk_14746k.build.clocksource=2
attiny1634.menu.clock.extclk_11059k=11.059 MHz (external clock)
attiny1634.menu.clock.extclk_11059k.bootloader.low_fuses=0xE0
attiny1634.menu.clock.extclk_11059k.build.f_cpu=11059000UL
attiny1634.menu.clock.extclk_11059k.build.speed=11059k
attiny1634.menu.clock.extclk_11059k.build.clocksource=2
attiny1634.menu.clock.extclk_9216k=9.216 MHz (external clock)
attiny1634.menu.clock.extclk_9216k.bootloader.low_fuses=0xE0
attiny1634.menu.clock.extclk_9216k.build.f_cpu=9216000UL
attiny1634.menu.clock.extclk_9216k.build.speed=9216k
attiny1634.menu.clock.extclk_9216k.build.clocksource=2
attiny1634.menu.clock.extclk_7372k=7.372 MHz (external clock)
attiny1634.menu.clock.extclk_7372k.bootloader.low_fuses=0xE0
attiny1634.menu.clock.extclk_7372k.build.f_cpu=7372000UL
attiny1634.menu.clock.extclk_7372k.build.speed=7372k
attiny1634.menu.clock.extclk_7372k.build.clocksource=2

#########################
# Pin Mapping menu      #
#########################
attiny1634.menu.pinmap.default=Standard (clockwise)
attiny1634.menu.pinmap.ccw=Legacy (counterclockwise)
attiny1634.menu.pinmap.ccw.build.variant=tiny1634_legacy
attiny1634.menu.pinmap.default.build.pinmapabr=.cw
attiny1634.menu.pinmap.ccw.build.pinmapabr=.ccw

#########################
# Retain EEPROM menu    #
#########################
attiny1634.menu.eesave.aenable=EEPROM retained
attiny1634.menu.eesave.aenable.bootloader.eesave_bit=0
attiny1634.menu.eesave.disable=EEPROM not retained
attiny1634.menu.eesave.disable.bootloader.eesave_bit=1

#########################
# BrownOut Detect menu  #
#########################
attiny1634.menu.bod.1v8=B.O.D. Enabled (1.8v)
attiny1634.menu.bod.1v8.bootloader.bod_bits=110
attiny1634.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny1634.menu.bod.2v7.bootloader.bod_bits=101
attiny1634.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny1634.menu.bod.4v3.bootloader.bod_bits=100
attiny1634.menu.bodact.disabled=B.O.D. Disabled (saves power)
attiny1634.menu.bodact.disabled.bootloader.bodact_bits=11
attiny1634.menu.bodact.enabled=B.O.D. Enabled
attiny1634.menu.bodact.enabled.bootloader.bodact_bits=10
attiny1634.menu.bodact.sampled=B.O.D. Sampled Mode
attiny1634.menu.bodact.sampled.bootloader.bodact_bits=01
attiny1634.menu.bodpd.disabled=B.O.D. Disabled (saves power)
attiny1634.menu.bodpd.disabled.bootloader.bodpd_bits=11
attiny1634.menu.bodpd.enabled=B.O.D. Enabled
attiny1634.menu.bodpd.enabled.bootloader.bodpd_bits=10
attiny1634.menu.bodpd.sampled=B.O.D. Sampled Mode
attiny1634.menu.bodpd.sampled.bootloader.bodpd_bits=01

#########################
# millis/micros menu    #
#########################
attiny1634.menu.millis.enabled=Enabled
attiny1634.menu.millis.enabled.build.millis=
attiny1634.menu.millis.enabled.build.millisabr=
attiny1634.menu.millis.disabled=Disabled (saves flash)
attiny1634.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attiny1634.menu.millis.disabled.build.millisabr=mNONE

