SpenceKonde/ATTinyCore/avr/boards.txt
#*******************************************************************************
#   ###  #####                   ##    #   ###  #  #      ###
#  #   #   #    #  #            ###   #       # #  #     #   #       #  #
#  #####   #   ###    ###  #  #  ##  ####   ##  ####     #   # ###  ###
#  #   #   #    #  #  #  # #  #  ##  #   #    #    #     #   # #  #  #  #
#  #   #   #    #  #  #  #  ### ####  ###  ###     #      ###  ###   #  #
#_____________________________#________________________________#________________
                           ###                                 #

attiny1634opti.build.board=AVR_ATTINY1634
attiny1634opti.build.core=tiny
attiny1634opti.build.variant=tiny1634_cw
attiny1634opti.build.export_merged_output=false
attiny1634opti.bootloader.extended_fuses=0b111{bootloader.bodpd_bits}{bootloader.bodact_bits}0
attiny1634opti.bootloader.high_fuses=0b{bootloader.rstbit}1011{bootloader.bod_bits}
attiny1634opti.bootloader.rstbit=1
attiny1634opti.build.usbpinset=
attiny1634opti.build.tuneorcal=
attiny1634opti.build.softserabr=
attiny1634opti.build.softser=
attiny1634opti.build.wiremodeabr=
attiny1634opti.build.wiremode=
attiny1634opti.upload.tool=avrdude
attiny1634opti.bootloader.tool=avrdude
attiny1634opti.bootloader.flashstring=-Uflash:w:{bootloader.file}:i
attiny1634opti.build.bootloader=-DUSING_BOOTLOADER=0x01
attiny1634opti.build.bootloaderabr=opti
attiny1634opti.bootloader.speed={build.f_cpu}
attiny1634opti.upload.protocol=arduino
attiny1634opti.bootloader.uart=
attiny1634opti.build.mcu=attiny1634

#########################
# Clocking menu options #
#########################
attiny1634opti.menu.clock.internal_8m_4v5=8 MHz (internal > 4.5V)
attiny1634opti.menu.clock.internal_8m_4v5.bootloader.low_fuses=0xE2
attiny1634opti.menu.clock.internal_8m_4v5.build.f_cpu=8000000L
attiny1634opti.menu.clock.internal_8m_4v5.build.speed=8m
attiny1634opti.menu.clock.internal_8m_4v5.build.clocksource=0
attiny1634opti.menu.clock.internal_8m_4v5.build.tuneorcal=-DCAL_NUDGE_DOWN
attiny1634opti.menu.clock.internal_8m_4v5.upload.speed=76800
attiny1634opti.menu.clock.internal_8m=8 MHz (internal)
attiny1634opti.menu.clock.internal_8m.bootloader.low_fuses=0xE2
attiny1634opti.menu.clock.internal_8m.build.f_cpu=8000000L
attiny1634opti.menu.clock.internal_8m.build.speed=8m
attiny1634opti.menu.clock.internal_8m.build.clocksource=0
attiny1634opti.menu.clock.internal_8m.upload.speed=76800
attiny1634opti.menu.clock.internal_1m=1 MHz (internal)
attiny1634opti.menu.clock.internal_1m.bootloader.low_fuses=0x62
attiny1634opti.menu.clock.internal_1m.build.f_cpu=1000000L
attiny1634opti.menu.clock.internal_1m.build.speed=1m
attiny1634opti.menu.clock.internal_1m.build.clocksource=0x10
attiny1634opti.menu.clock.internal_1m.upload.speed=9600
attiny1634opti.menu.clock.internal_4m=4 MHz (internal)
attiny1634opti.menu.clock.internal_4m.bootloader.low_fuses=0x62
attiny1634opti.menu.clock.internal_4m.build.f_cpu=4000000L
attiny1634opti.menu.clock.internal_4m.build.speed=4m
attiny1634opti.menu.clock.internal_4m.build.clocksource=0x10
attiny1634opti.menu.clock.internal.4m.bootloader.f_cpu=1000000L
attiny1634opti.menu.clock.internal_4m.upload.speed=9600
attiny1634opti.menu.clock.internal_2m=2 MHz (internal)
attiny1634opti.menu.clock.internal_2m.bootloader.low_fuses=0x62
attiny1634opti.menu.clock.internal_2m.build.f_cpu=2000000L
attiny1634opti.menu.clock.internal_2m.build.speed=2m
attiny1634opti.menu.clock.internal_2m.build.clocksource=0x10
attiny1634opti.menu.clock.internal.2m.bootloader.f_cpu=1000000L
attiny1634opti.menu.clock.internal_2m.upload.speed=9600
attiny1634opti.menu.clock.crystal_16m=16 MHz (crystal)
attiny1634opti.menu.clock.crystal_16m.bootloader.low_fuses=0xFF
attiny1634opti.menu.clock.crystal_16m.build.f_cpu=16000000UL
attiny1634opti.menu.clock.crystal_16m.build.speed=16
attiny1634opti.menu.clock.crystal_16m.build.clocksource=1
attiny1634opti.menu.clock.crystal_8m=8 MHz (crystal)
attiny1634opti.menu.clock.crystal_8m.bootloader.low_fuses=0xFF
attiny1634opti.menu.clock.crystal_8m.build.f_cpu=8000000UL
attiny1634opti.menu.clock.crystal_8m.build.speed=8
attiny1634opti.menu.clock.crystal_8m.build.clocksource=1
attiny1634opti.menu.clock.crystal_20m=20 MHz (crystal)
attiny1634opti.menu.clock.crystal_20m.bootloader.low_fuses=0xFF
attiny1634opti.menu.clock.crystal_20m.build.f_cpu=20000000UL
attiny1634opti.menu.clock.crystal_20m.build.speed=20
attiny1634opti.menu.clock.crystal_20m.build.clocksource=1
attiny1634opti.menu.clock.crystal_12m=12 MHz (crystal)
attiny1634opti.menu.clock.crystal_12m.bootloader.low_fuses=0xFF
attiny1634opti.menu.clock.crystal_12m.build.f_cpu=12000000UL
attiny1634opti.menu.clock.crystal_12m.build.speed=12
attiny1634opti.menu.clock.crystal_12m.build.clocksource=1
attiny1634opti.menu.clock.crystal_6m=6 MHz (crystal)
attiny1634opti.menu.clock.crystal_6m.bootloader.low_fuses=0xFD
attiny1634opti.menu.clock.crystal_6m.build.f_cpu=6000000UL
attiny1634opti.menu.clock.crystal_6m.build.speed=6
attiny1634opti.menu.clock.crystal_6m.build.clocksource=1
attiny1634opti.menu.clock.crystal_18432k=18.432 MHz (crystal)
attiny1634opti.menu.clock.crystal_18432k.bootloader.low_fuses=0xFF
attiny1634opti.menu.clock.crystal_18432k.build.f_cpu=18432000UL
attiny1634opti.menu.clock.crystal_18432k.build.speed=18432k
attiny1634opti.menu.clock.crystal_18432k.build.clocksource=1
attiny1634opti.menu.clock.crystal_14746k=14.746 MHz (crystal)
attiny1634opti.menu.clock.crystal_14746k.bootloader.low_fuses=0xFF
attiny1634opti.menu.clock.crystal_14746k.build.f_cpu=14746000UL
attiny1634opti.menu.clock.crystal_14746k.build.speed=14746k
attiny1634opti.menu.clock.crystal_14746k.build.clocksource=1
attiny1634opti.menu.clock.crystal_11059k=11.059 MHz (crystal)
attiny1634opti.menu.clock.crystal_11059k.bootloader.low_fuses=0xFF
attiny1634opti.menu.clock.crystal_11059k.build.f_cpu=11059000UL
attiny1634opti.menu.clock.crystal_11059k.build.speed=11059k
attiny1634opti.menu.clock.crystal_11059k.build.clocksource=1
attiny1634opti.menu.clock.crystal_9216k=9.216 MHz (crystal)
attiny1634opti.menu.clock.crystal_9216k.bootloader.low_fuses=0xFF
attiny1634opti.menu.clock.crystal_9216k.build.f_cpu=9216000UL
attiny1634opti.menu.clock.crystal_9216k.build.speed=9216k
attiny1634opti.menu.clock.crystal_9216k.build.clocksource=1
attiny1634opti.menu.clock.crystal_7372k=7.372 MHz (crystal)
attiny1634opti.menu.clock.crystal_7372k.bootloader.low_fuses=0xFD
attiny1634opti.menu.clock.crystal_7372k.build.f_cpu=7372000UL
attiny1634opti.menu.clock.crystal_7372k.build.speed=7372k
attiny1634opti.menu.clock.crystal_7372k.build.clocksource=1
attiny1634opti.menu.clock.internal_12m=12 MHz (internal, tuned)
attiny1634opti.menu.clock.internal_12m.bootloader.low_fuses=0xE2
attiny1634opti.menu.clock.internal_12m.build.f_cpu=12000000L
attiny1634opti.menu.clock.internal_12m.build.speed=12m
attiny1634opti.menu.clock.internal_12m.build.clocksource=0
attiny1634opti.menu.clock.internal_12m.upload.speed=115200
attiny1634opti.menu.clock.internal_8m_tuned=8 MHz (internal, tuned)
attiny1634opti.menu.clock.internal_8m_tuned_low.bootloader.low_fuses=0xE2
attiny1634opti.menu.clock.internal_8m_tuned_low.build.f_cpu=8000000L
attiny1634opti.menu.clock.internal_8m_tuned_low.build.speed=8m
attiny1634opti.menu.clock.internal_8m_tuned_low.build.clocksource=0
attiny1634opti.menu.clock.internal_8m_tuned_low.upload.speed=76800
attiny1634opti.menu.clock.internal_8m_tuned_high=8 MHz (internal, tuned)
attiny1634opti.menu.clock.internal_8m_tuned_high.bootloader.low_fuses=0xE2
attiny1634opti.menu.clock.internal_8m_tuned_high.build.f_cpu=8000000L
attiny1634opti.menu.clock.internal_8m_tuned_high.build.speed=8m
attiny1634opti.menu.clock.internal_8m_tuned_high.build.clocksource=0
attiny1634opti.menu.clock.internal_8m_tuned_high.upload.speed=76800
attiny1634opti.menu.clock.extclk_16m=16 MHz (external clock)
attiny1634opti.menu.clock.extclk_16m.bootloader.low_fuses=0xE0
attiny1634opti.menu.clock.extclk_16m.build.f_cpu=16000000UL
attiny1634opti.menu.clock.extclk_16m.build.speed=16
attiny1634opti.menu.clock.extclk_16m.build.clocksource=2
attiny1634opti.menu.clock.extclk_16m.upload.speed=76800
attiny1634opti.menu.clock.extclk_8m=8 MHz (external clock)
attiny1634opti.menu.clock.extclk_8m.bootloader.low_fuses=0xE0
attiny1634opti.menu.clock.extclk_8m.build.f_cpu=8000000UL
attiny1634opti.menu.clock.extclk_8m.build.speed=8
attiny1634opti.menu.clock.extclk_8m.build.clocksource=2
attiny1634opti.menu.clock.extclk_8m.upload.speed=76800
attiny1634opti.menu.clock.extclk_20m=20 MHz (external clock)
attiny1634opti.menu.clock.extclk_20m.bootloader.low_fuses=0xE0
attiny1634opti.menu.clock.extclk_20m.build.f_cpu=20000000UL
attiny1634opti.menu.clock.extclk_20m.build.speed=20
attiny1634opti.menu.clock.extclk_20m.build.clocksource=2
attiny1634opti.menu.clock.extclk_20m.upload.speed=115200
attiny1634opti.menu.clock.extclk_12m=12 MHz (external clock)
attiny1634opti.menu.clock.extclk_12m.bootloader.low_fuses=0xE0
attiny1634opti.menu.clock.extclk_12m.build.f_cpu=12000000UL
attiny1634opti.menu.clock.extclk_12m.build.speed=12
attiny1634opti.menu.clock.extclk_12m.build.clocksource=2
attiny1634opti.menu.clock.extclk_12m.upload.speed=115200
attiny1634opti.menu.clock.extclk_6m=6 MHz (external clock)
attiny1634opti.menu.clock.extclk_6m.bootloader.low_fuses=0xE0
attiny1634opti.menu.clock.extclk_6m.build.f_cpu=6000000UL
attiny1634opti.menu.clock.extclk_6m.build.speed=6
attiny1634opti.menu.clock.extclk_6m.build.clocksource=2
attiny1634opti.menu.clock.extclk_6m.upload.speed=57600
attiny1634opti.menu.clock.extclk_18432k=18.432 MHz (external clock)
attiny1634opti.menu.clock.extclk_18432k.bootloader.low_fuses=0xE0
attiny1634opti.menu.clock.extclk_18432k.build.f_cpu=18432000UL
attiny1634opti.menu.clock.extclk_18432k.build.speed=18432k
attiny1634opti.menu.clock.extclk_18432k.build.clocksource=2
attiny1634opti.menu.clock.extclk_18432k.upload.speed=115200
attiny1634opti.menu.clock.extclk_14746k=14.746 MHz (external clock)
attiny1634opti.menu.clock.extclk_14746k.bootloader.low_fuses=0xE0
attiny1634opti.menu.clock.extclk_14746k.build.f_cpu=14746000UL
attiny1634opti.menu.clock.extclk_14746k.build.speed=14746k
attiny1634opti.menu.clock.extclk_14746k.build.clocksource=2
attiny1634opti.menu.clock.extclk_14746k.upload.speed=115200
attiny1634opti.menu.clock.extclk_11059k=11.059 MHz (external clock)
attiny1634opti.menu.clock.extclk_11059k.bootloader.low_fuses=0xE0
attiny1634opti.menu.clock.extclk_11059k.build.f_cpu=11059000UL
attiny1634opti.menu.clock.extclk_11059k.build.speed=11059k
attiny1634opti.menu.clock.extclk_11059k.build.clocksource=2
attiny1634opti.menu.clock.extclk_11059k.upload.speed=115200
attiny1634opti.menu.clock.extclk_9216k=9.216 MHz (external clock)
attiny1634opti.menu.clock.extclk_9216k.bootloader.low_fuses=0xE0
attiny1634opti.menu.clock.extclk_9216k.build.f_cpu=9216000UL
attiny1634opti.menu.clock.extclk_9216k.build.speed=9216k
attiny1634opti.menu.clock.extclk_9216k.build.clocksource=2
attiny1634opti.menu.clock.extclk_9216k.upload.speed=115200
attiny1634opti.menu.clock.extclk_7372k=7.372 MHz (external clock)
attiny1634opti.menu.clock.extclk_7372k.bootloader.low_fuses=0xE0
attiny1634opti.menu.clock.extclk_7372k.build.f_cpu=7372000UL
attiny1634opti.menu.clock.extclk_7372k.build.speed=7372k
attiny1634opti.menu.clock.extclk_7372k.build.clocksource=2
attiny1634opti.menu.clock.extclk_7372k.upload.speed=76800

#########################
# Pin Mapping menu      #
#########################
attiny1634opti.menu.pinmap.default=Standard (clockwise)
attiny1634opti.menu.pinmap.ccw=Legacy (counterclockwise)
attiny1634opti.menu.pinmap.ccw.build.variant=tiny1634_legacy
attiny1634opti.menu.pinmap.default.build.pinmapabr=.cw
attiny1634opti.menu.pinmap.ccw.build.pinmapabr=.ccw

#########################
# BrownOut Detect menu  #
#########################
attiny1634opti.menu.bod.1v8=B.O.D. Enabled (1.8v)
attiny1634opti.menu.bod.1v8.bootloader.bod_bits=110
attiny1634opti.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny1634opti.menu.bod.2v7.bootloader.bod_bits=101
attiny1634opti.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny1634opti.menu.bod.4v3.bootloader.bod_bits=100
attiny1634opti.menu.bodact.disabled=B.O.D. Disabled (saves power)
attiny1634opti.menu.bodact.disabled.bootloader.bodact_bits=11
attiny1634opti.menu.bodact.enabled=B.O.D. Enabled
attiny1634opti.menu.bodact.enabled.bootloader.bodact_bits=10
attiny1634opti.menu.bodact.sampled=B.O.D. Sampled Mode
attiny1634opti.menu.bodact.sampled.bootloader.bodact_bits=01
attiny1634opti.menu.bodpd.disabled=B.O.D. Disabled (saves power)
attiny1634opti.menu.bodpd.disabled.bootloader.bodpd_bits=11
attiny1634opti.menu.bodpd.enabled=B.O.D. Enabled
attiny1634opti.menu.bodpd.enabled.bootloader.bodpd_bits=10
attiny1634opti.menu.bodpd.sampled=B.O.D. Sampled Mode
attiny1634opti.menu.bodpd.sampled.bootloader.bodpd_bits=01

#########################
# millis/micros menu    #
#########################
attiny1634opti.menu.millis.enabled=Enabled
attiny1634opti.menu.millis.enabled.build.millis=
attiny1634opti.menu.millis.enabled.build.millisabr=
attiny1634opti.menu.millis.disabled=Disabled (saves flash)
attiny1634opti.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attiny1634opti.menu.millis.disabled.build.millisabr=mNONE

#########################
# Boot Entrymode menu   #
#########################
attiny1634opti.menu.bootentry.1s=Standard (1s wait, for use w/autoreset)
attiny1634opti.menu.bootentry.1s.bootloader.file=optiboot/optiboot_{build.mcu}_{build.f_cpu}{bootloader.uart}.hex
attiny1634opti.menu.bootentry.8s=8-second (8s wait, for use w. out/autoreset)
attiny1634opti.menu.bootentry.8s_8sec.bootloader.file=optiboot/optiboot_{build.mcu}_{build.f_cpu}{bootloader.uart}_8sec.hex

################################
# Serial Port:                 #
################################
attiny1634opti.menu.bootloaderuart.uart0=Serial 0 (TX: PB0, RX: PA7, LED: PC0)
attiny1634opti.menu.bootloaderuart.uart1=Serial 1 (TX: PB0, RX: PA7, LED: PC0)
attiny1634opti.menu.bootloaderuart.uart0.bootloader.uart=
attiny1634opti.menu.bootloaderuart.uart1.bootloader.uart=_ser1


################################################################################
#           #                                                      #           #
############        ####    ###    ###   ####   ####    ###         ############
#           #       #   #  #   #  #   #  #   #  #   #  #           #           #
############        ####   #   #  #####  ####   #   #   ###         ############
#           #       #   #  #   #  #   #  #  #   #   #      #       #           #
############        ####    ###   #   #  #   #  ####    ###         ############
#___________#______________________________________________________#___________#
#            With Micronucleus, the VUSB bootloader like Digispark             #
#     Available for parts with at least 8k of flash that are decent.           #
#     85 (Digispark and clones), 87, 167 (Digispark Pro and clones), 84,       #
#     88 (MH-TINY), 841 (Wattuino Nanite and others),                          #
#     861 and 1634 (Azduino USB 861, 1634, coming soon)                        #
#______________________________________________________________________________#

