SpenceKonde/ATTinyCore/avr/boards.txt
#*******************************************************************************
#   ###  #####                      #####         #   #  ###  ####
#  #   #   #    #  #                   #          #   # #     #   #
#  #####   #   ###    ###  #  # # #   #       # # #   #  ###  ####
#  #   #   #    #  #  #  # #  #  #    #       # # #   #     # #   #
#  #   #   #    #  #  #  #  ### # #   #        #   ###  ####  ####
#_____________________________#_______________________________________________________
                           ###

attinyx7micr.build.board=AVR_ATTINYX7
attinyx7micr.build.core=tiny
attinyx7micr.build.variant=tinyx7_digi
attinyx7micr.build.export_merged_output=false
attinyx7micr.bootloader.extended_fuses=0xFE
attinyx7micr.bootloader.high_fuses=0b{bootloader.rstbit}1011{bootloader.bod_bits}
attinyx7micr.bootloader.rstbit=1
attinyx7micr.build.usbpinset=
attinyx7micr.build.tuneorcal=
attinyx7micr.build.softserabr=
attinyx7micr.build.softser=
attinyx7micr.build.wiremodeabr=
attinyx7micr.build.wiremode=
attinyx7micr.build.bootloader=-DUSING_BOOTLOADER=0x08
attinyx7micr.build.bootloaderabr=micr
attinyx7micr.upload.tool=micronucleus
attinyx7micr.bootloader.devpostfix=

#########################
# Microcontroller menu  #
#########################
attinyx7micr.menu.chip.167=ATtiny167
attinyx7micr.menu.chip.167.build.mcu=attiny167
attinyx7micr.menu.chip.167.upload.maximum_size={upload.entrymaxsize}
attinyx7micr.menu.chip.87=ATtiny87
attinyx7micr.menu.chip.87.build.mcu=attiny87
attinyx7micr.menu.chip.87.upload.maximum_size=6654

#########################
# Clocking menu options #
#########################
attinyx7micr.menu.clock.crystal_16m=16 MHz (external crystal)
attinyx7micr.menu.clock.crystal_16m.bootloader.low_fuses=0xF0
attinyx7micr.menu.clock.crystal_16m.build.f_cpu=16000000UL
attinyx7micr.menu.clock.crystal_16m.build.speed=16
attinyx7micr.menu.clock.crystal_16m.build.clocksource=1
attinyx7micr.menu.clock.crystal_8m=8 MHz (prescaled 16 MHz external crystal)
attinyx7micr.menu.clock.crystal_8m.bootloader.low_fuses=0xF0
attinyx7micr.menu.clock.crystal_8m.build.f_cpu=8000000UL
attinyx7micr.menu.clock.crystal_8m.build.speed=8
attinyx7micr.menu.clock.crystal_8m.build.clocksource=0x11
attinyx7micr.menu.clock.crystal_4m=4 MHz (prescaled 16 MHz external crystal)
attinyx7micr.menu.clock.crystal_4m.bootloader.low_fuses=0xF0
attinyx7micr.menu.clock.crystal_4m.build.f_cpu=4000000UL
attinyx7micr.menu.clock.crystal_4m.build.speed=4
attinyx7micr.menu.clock.crystal_4m.build.clocksource=0x11
attinyx7micr.menu.clock.crystal_2m=2 MHz (prescaled 16 MHz external crystal)
attinyx7micr.menu.clock.crystal_2m.bootloader.low_fuses=0xF0
attinyx7micr.menu.clock.crystal_2m.build.f_cpu=2000000UL
attinyx7micr.menu.clock.crystal_2m.build.speed=2
attinyx7micr.menu.clock.crystal_2m.build.clocksource=0x11
attinyx7micr.menu.clock.crystal_1m=1 MHz (prescaled 16 MHz external crystal)
attinyx7micr.menu.clock.crystal_1m.bootloader.low_fuses=0xF0
attinyx7micr.menu.clock.crystal_1m.build.f_cpu=1000000UL
attinyx7micr.menu.clock.crystal_1m.build.speed=1
attinyx7micr.menu.clock.crystal_1m.build.clocksource=0x11

#########################
# Pin Mapping menu      #
#########################
attinyx7micr.menu.pinmap.digi=Digispark Pro
attinyx7micr.menu.pinmap.standard=Standard/Azduino
attinyx7micr.menu.pinmap.standard.build.variant=tinyx7
attinyx7micr.menu.pinmap.digi.build.variant=tinyx7_digi
attinyx7micr.menu.pinmap.legacy=Legacy
attinyx7micr.menu.pinmap.legacy.build.variant=tinyx7_legacy
attinyx7micr.menu.pinmap.default.build.pinmapabr=
attinyx7micr.menu.pinmap.digi.build.pinmapabr=.digi
attinyx7micr.menu.pinmap.legacy.build.pinmapabr=.old

#########################
# BrownOut Detect menu  #
#########################
attinyx7micr.menu.bod.disable=B.O.D. Disabled (saves power)
attinyx7micr.menu.bod.disable.bootloader.bod_bits=111
attinyx7micr.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx7micr.menu.bod.1v8.bootloader.bod_bits=110
attinyx7micr.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx7micr.menu.bod.2v7.bootloader.bod_bits=101
attinyx7micr.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx7micr.menu.bod.4v3.bootloader.bod_bits=100

#########################
# millis/micros menu    #
#########################
attinyx7micr.menu.millis.enabled=Enabled
attinyx7micr.menu.millis.enabled.build.millis=
attinyx7micr.menu.millis.enabled.build.millisabr=
attinyx7micr.menu.millis.disabled=Disabled (saves flash)
attinyx7micr.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attinyx7micr.menu.millis.disabled.build.millisabr=mNONE

#########################
# Boot Entrymode menu   #
#########################
attinyx7micr.menu.bootentry.extrf_porf=External Reset and Power On Reset
attinyx7micr.menu.bootentry.extrf_porf.bootloader.entrymode=extrf_porf
attinyx7micr.menu.bootentry.extrf_safe=External Reset, or if reset pin disabled and HIGH
attinyx7micr.menu.bootentry.extrf_safe.bootloader.entrymode=extrf_safe
attinyx7micr.menu.bootentry.extrfonly_safe=External Reset only, or if reset pin disabled and HIGH
attinyx7micr.menu.bootentry.extrfonly_safe.bootloader.entrymode=extrfonly_safe
attinyx7micr.menu.bootentry.wdrf=Watchdog Reset only
attinyx7micr.menu.bootentry.wdrf.bootloader.entrymode=wdrf
attinyx7micr.menu.bootentry.porf=Power On Reset only
attinyx7micr.menu.bootentry.porf.bootloader.entrymode=porf
attinyx7micr.menu.bootentry.anyreset=Any reset (but not jump from app)
attinyx7micr.menu.bootentry.anyreset.bootloader.entrymode=anyreset
attinyx7micr.menu.bootentry.always=Always (permits jump from app)
attinyx7micr.menu.bootentry.always.bootloader.entrymode=always
attinyx7micr.menu.bootentry.jumper=Jumper (see documentation) (permits jump from app)
attinyx7micr.menu.bootentry.jumper.bootloader.entrymode=jumper
attinyx7micr.upload.entrymaxsize=14844
attinyx7micr.menu.bootentry.jumper.upload.entrymaxsize=14716

################################
# Pins used for USB            #
################################
attinyx7micr.menu.usbpins.digispark=Digispark Pro - PB3: D-, PB6: D+, PB1: LED
attinyx7micr.menu.usbpins.azduino=Azduino 167 USB - PB3: D-, PB6: D+, PA6: LED
attinyx7micr.menu.usbpins.digispark.build.usbpinset=-DLED_BUILTIN=PIN_PB1
attinyx7micr.menu.usbpins.azduino.build.usbpinset=-DLED_BUILTIN=PIN_PA6
attinyx7micr.menu.usbpins.digispark.bootloader.usbpinsetname=pb1led
attinyx7micr.menu.usbpins.azduino.bootloader.usbpinsetname=pa6led
attinyx7micr.menu.resetpin.reset=Reset pin. Further ISP programming possible
attinyx7micr.menu.resetpin.reset.bootloader.rstbit=1
attinyx7micr.menu.resetpin.gpio=I/O pin - DANGER: If anything goes wrong, only HV programming can unbrick!
attinyx7micr.menu.resetpin.gpio.bootloader.rstbit=0

################################
# Upgrade vs ISP install menu  #
################################
attinyx7micr.menu.burnmode.upgrade=Upgrade (via USB)
attinyx7micr.menu.burnmode.upgrade.bootloader.file=micronucleus/hex/upgrade-attinyx7micr{bootloader.devpostfix}{bootloader.usbpinsetname}_{bootloader.entrymode}.hex
attinyx7micr.menu.burnmode.upgrade.bootloader.tool=micronucleus
attinyx7micr.menu.burnmode.install=Fresh Install (via ISP)
attinyx7micr.menu.burnmode.install.bootloader.file=micronucleus/hex/attinyx7micr{bootloader.devpostfix}{bootloader.usbpinsetname}_{bootloader.entrymode}.hex
attinyx7micr.menu.burnmode.install.bootloader.tool=avrdude
attinyx7micr.menu.burnmode.install.bootloader.flashstring=-Uflash:w:{bootloader.file}:i

