SpenceKonde/ATTinyCore/avr/boards.txt
#*******************************************************************************
#   ###  #####                      #  #  ##          #   #  ###  ####
#  #   #   #    #  #                #  # ###          #   # #     #   #
#  #####   #   ###    ###  #  # # # ####  ##      # # #   #  ###  ####
#  #   #   #    #  #  #  # #  #  #     #  ##      # # #   #     # #   #
#  #   #   #    #  #  #  #  ### # #    # ####      #   ###  ####  ####
#_____________________________#_______________________________________________________
                           ###

attiny841micr.build.board=AVR_ATTINY841
attiny841micr.build.core=tiny
attiny841micr.build.variant=tinyx41_cw
attiny841micr.build.export_merged_output=false
attiny841micr.bootloader.extended_fuses=0b111{bootloader.bodpd_bits}{bootloader.bodact_bits}0
attiny841micr.bootloader.high_fuses=0b{bootloader.rstbit}1011{bootloader.bod_bits}
attiny841micr.bootloader.rstbit=1
attiny841micr.build.usbpinset=
attiny841micr.build.tuneorcal=
attiny841micr.build.softserabr=
attiny841micr.build.softser=
attiny841micr.build.bootloader=-DUSING_BOOTLOADER=0x08
attiny841micr.build.bootloaderabr=micr
attiny841micr.upload.tool=micronucleus
attiny841micr.bootloader.devpostfix=
attiny841micr.build.mcu=attiny841

#########################
# Clocking menu options #
#########################
attiny841micr.menu.clock.internal_8m=8 MHz internal
attiny841micr.menu.clock.internal_8m.bootloader.low_fuses=0xE2
attiny841micr.menu.clock.internal_8m.build.f_cpu=8000000L
attiny841micr.menu.clock.internal_8m.build.speed=8m
attiny841micr.menu.clock.internal_8m.build.clocksource=0
attiny841micr.menu.clock.internal_8m.build.extra_flags=-DBOOT_TUNED120
attiny841micr.menu.clock.internal_16m=16 MHz (internal via tuning/guess)
attiny841micr.menu.clock.internal_16m.bootloader.low_fuses=0xE2
attiny841micr.menu.clock.internal_16m.build.f_cpu=16000000L
attiny841micr.menu.clock.internal_16m.build.speed=16m
attiny841micr.menu.clock.internal_16m.build.clocksource=0
attiny841micr.menu.clock.internal_16m.build.extra_flags=-DBOOT_TUNED120
attiny841micr.menu.clock.internal_12m=12 MHz (tuned by bootloader)
attiny841micr.menu.clock.internal_12m.bootloader.low_fuses=0xE2
attiny841micr.menu.clock.internal_12m.build.f_cpu=12000000L
attiny841micr.menu.clock.internal_12m.build.speed=12m
attiny841micr.menu.clock.internal_12m.build.clocksource=0
attiny841micr.menu.clock.internal_12m.build.extra_flags=-DBOOT_TUNED120

#########################
# Pin Mapping menu      #
#########################
attiny841micr.menu.pinmap.default=Standard (clockwise)
attiny841micr.menu.pinmap.ccw=Legacy (counterclockwise)
attiny841micr.menu.pinmap.ccw.build.variant=tinyx41_legacy
attiny841micr.menu.pinmap.default.build.pinmapabr=.cw
attiny841micr.menu.pinmap.ccw.build.pinmapabr=.ccw

#########################
# Wire Modes menu       #
#########################
attiny841micr.menu.wiremode.master=Master Only
attiny841micr.menu.wiremode.master.build.wiremode=-DWIRE_MASTER_ONLY
attiny841micr.menu.wiremode.slave=Slave Only
attiny841micr.menu.wiremode.slave.build.wiremode=-DWIRE_SLAVE_ONLY
attiny841micr.menu.wiremode.slave.build.wiremodeabr=wS
attiny841micr.menu.wiremode.both=Either (uses more flash)
attiny841micr.menu.wiremode.both.build.wiremode=-DWIRE_BOTH
attiny841micr.menu.wiremode.slave.build.wiremodeabr=wB

#########################
# BrownOut Detect menu  #
#########################
attiny841micr.menu.bod.1v8=B.O.D. Enabled (1.8v)
attiny841micr.menu.bod.1v8.bootloader.bod_bits=110
attiny841micr.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny841micr.menu.bod.2v7.bootloader.bod_bits=101
attiny841micr.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny841micr.menu.bod.4v3.bootloader.bod_bits=100
attiny841micr.menu.bodact.disabled=B.O.D. Disabled (saves power)
attiny841micr.menu.bodact.disabled.bootloader.bodact_bits=11
attiny841micr.menu.bodact.enabled=B.O.D. Enabled
attiny841micr.menu.bodact.enabled.bootloader.bodact_bits=10
attiny841micr.menu.bodact.sampled=B.O.D. Sampled Mode
attiny841micr.menu.bodact.sampled.bootloader.bodact_bits=01
attiny841micr.menu.bodpd.disabled=B.O.D. Disabled (saves power)
attiny841micr.menu.bodpd.disabled.bootloader.bodpd_bits=11
attiny841micr.menu.bodpd.enabled=B.O.D. Enabled
attiny841micr.menu.bodpd.enabled.bootloader.bodpd_bits=10
attiny841micr.menu.bodpd.sampled=B.O.D. Sampled Mode
attiny841micr.menu.bodpd.sampled.bootloader.bodpd_bits=01

#########################
# millis/micros menu    #
#########################
attiny841micr.menu.millis.enabled=Enabled
attiny841micr.menu.millis.enabled.build.millis=
attiny841micr.menu.millis.enabled.build.millisabr=
attiny841micr.menu.millis.disabled=Disabled (saves flash)
attiny841micr.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attiny841micr.menu.millis.disabled.build.millisabr=mNONE

#########################
# Boot Entrymode menu   #
#########################
attiny841micr.menu.bootentry.extrf_porf=External Reset and Power On Reset
attiny841micr.menu.bootentry.extrf_porf.bootloader.entrymode=extrf_porf
attiny841micr.menu.bootentry.extrf_safe=External Reset, or if reset pin disabled and HIGH
attiny841micr.menu.bootentry.extrf_safe.bootloader.entrymode=extrf_safe
attiny841micr.menu.bootentry.extrfonly_safe=External Reset only, or if reset pin disabled and HIGH
attiny841micr.menu.bootentry.extrfonly_safe.bootloader.entrymode=extrfonly_safe
attiny841micr.menu.bootentry.wdrf=Watchdog Reset only
attiny841micr.menu.bootentry.wdrf.bootloader.entrymode=wdrf
attiny841micr.menu.bootentry.porf=Power On Reset only
attiny841micr.menu.bootentry.porf.bootloader.entrymode=porf
attiny841micr.menu.bootentry.anyreset=Any reset (but not jump from app)
attiny841micr.menu.bootentry.anyreset.bootloader.entrymode=anyreset
attiny841micr.menu.bootentry.always=Always (permits jump from app)
attiny841micr.menu.bootentry.always.bootloader.entrymode=always
attiny841micr.menu.bootentry.jumper=Jumper (see documentation) (permits jump from app)
attiny841micr.menu.bootentry.jumper.bootloader.entrymode=jumper
attiny841micr.menu.bootentry.always.upload.maximum_size=6588

################################
# Pins used for USB            #
################################
attiny841micr.menu.usbpins.pb1plus=PB0: D-, PB1: D+, PB2: LED (Bitboss)
attiny841micr.menu.usbpins.pb0plus=PB0: D+, PB1: D-, PB2: LED (Wattuino)
attiny841micr.menu.usbpins.pb2plus=PB0: LED, PB1: D-, PB2: D+
attiny841micr.menu.usbpins.pb2plus.build.usbpinset=-DUSB_TWOPLUS -DLED_BUILTIN=PIN_PB0
attiny841micr.menu.usbpins.pb1plus.build.usbpinset=-DUSB_ONEPLUS
attiny841micr.menu.usbpins.pb0plus.build.usbpinset=-DUSB_ZEROPLUS
attiny841micr.menu.usbpins.pb2plus.bootloader.usbpinsetname=_pb2plus
attiny841micr.menu.usbpins.pb1plus.bootloader.usbpinsetname=_pb1plus
attiny841micr.menu.usbpins.pb0plus.bootloader.usbpinsetname=_pb0plus
attiny841micr.menu.resetpin.reset=Reset pin. Further ISP programming possible
attiny841micr.menu.resetpin.reset.bootloader.rstbit=1
attiny841micr.menu.resetpin.gpio=I/O pin - DANGER: If anything goes wrong, only HV programming can unbrick!
attiny841micr.menu.resetpin.gpio.bootloader.rstbit=0

################################
# Upgrade vs ISP install menu  #
################################
attiny841micr.menu.burnmode.upgrade=Upgrade (via USB)
attiny841micr.menu.burnmode.upgrade.bootloader.file=micronucleus/hex/upgrade-attiny841micr{bootloader.devpostfix}{bootloader.usbpinsetname}_{bootloader.entrymode}.hex
attiny841micr.menu.burnmode.upgrade.bootloader.tool=micronucleus
attiny841micr.menu.burnmode.install=Fresh Install (via ISP)
attiny841micr.menu.burnmode.install.bootloader.file=micronucleus/hex/attiny841micr{bootloader.devpostfix}{bootloader.usbpinsetname}_{bootloader.entrymode}.hex
attiny841micr.menu.burnmode.install.bootloader.tool=avrdude
attiny841micr.menu.burnmode.install.bootloader.flashstring=-Uflash:w:{bootloader.file}:i

